In [5]:
def variance_std(input_data1):
    import math as m
    mean = sum(input_data1)/len(input_data1)
    new_list= []
    for i in input_data1:
        result = (mean-i)**2
        new_list.append(result)
    variance = sum(new_list)/(len(new_list)-1)
    std = m.sqrt(variance)
    return ('Mean value is', mean,'variance value is:', variance, 'Standarad deviation is ', std )

In [6]:
age = [22, 24, 25, 26, 27, 34, 32, 35, 19, 22, 31, 26, 36]

In [7]:
variance_std(age)

('Mean value is',
 27.615384615384617,
 'variance value is:',
 29.923076923076923,
 'Standarad deviation is ',
 5.470198983864931)

In [8]:
import pandas as pd
df1 = pd.read_csv('cars.csv')
df1.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [9]:
df1['Kilometers_Driven'].mean()

58738.38029573019

In [10]:
df1['Kilometers_Driven'].var()

8330001740.206769

In [11]:
df1['Kilometers_Driven'].std()

91268.84320624848

In [12]:
variance_std(df1['Kilometers_Driven'])

('Mean value is',
 58738.38029573019,
 'variance value is:',
 8330001740.206769,
 'Standarad deviation is ',
 91268.84320624848)

In [13]:
df1.columns

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power',
       'Seats', 'New_Price', 'Price'],
      dtype='object')

In [14]:
columns = [ 'Year', 'Kilometers_Driven']

In [15]:
for i in columns:
    print ('********', i, '*********')
    result = variance_std(df1[i])
    print (result)
    print ('*****************')

******** Year *********
('Mean value is', 2013.3581990363848, 'variance value is:', 10.691213505741768, 'Standarad deviation is ', 3.269742116091385)
*****************
******** Kilometers_Driven *********
('Mean value is', 58738.38029573019, 'variance value is:', 8330001740.206769, 'Standarad deviation is ', 91268.84320624848)
*****************

In [16]:
df1.describe()

        Unnamed: 0         Year  Kilometers_Driven        Seats        Price
count  6019.000000  6019.000000       6.019000e+03  5977.000000  6019.000000
mean   3009.000000  2013.358199       5.873838e+04     5.278735     9.479468
std    1737.679967     3.269742       9.126884e+04     0.808840    11.187917
min       0.000000  1998.000000       1.710000e+02     0.000000     0.440000
25%    1504.500000  2011.000000       3.400000e+04     5.000000     3.500000
50%    3009.000000  2014.000000       5.300000e+04     5.000000     5.640000
75%    4513.500000  2016.000000       7.300000e+04     5.000000     9.950000
max    6018.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [17]:
df1.shape

(6019, 14)

# missing values

In [18]:
df1.isnull() # True means missing value

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6014,False,False,False,False,False,False,False,False,False,False,False,False,False,False
6015,False,False,False,False,False,False,False,False,False,False,False,False,True,False
6016,False,False,False,False,False,False,False,False,False,False,False,False,True,False
6017,False,False,False,False,False,False,False,False,False,False,False,False,True,False
6018,False,False,False,False,False,False,False,False,False,False,False,False,True,False

In [19]:
df1.isnull().sum()

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [20]:
for i in df1.columns:
    print ('*******', i, '********')
    print (df1[i].isnull().sum())
    result = df1[i].isnull().sum()/len(df1)
    print (result)
    print ('***************')

******* Unnamed: 0 ********
0
0.0
***************
******* Name ********
0
0.0
***************
******* Location ********
0
0.0
***************
******* Year ********
0
0.0
***************
******* Kilometers_Driven ********
0
0.0
***************
******* Fuel_Type ********
0
0.0
***************
******* Transmission ********
0
0.0
***************
******* Owner_Type ********
0
0.0
***************
******* Mileage ********
2
0.0003322811098189068
***************
******* Engine ********
36
0.005981059976740323
***************
******* Power ********
36
0.005981059976740323
***************
******* Seats ********
42
0.006977903306197043
***************
******* New_Price ********
5195
0.8631001827546104
***************
******* Price ********
0
0.0
***************

In [21]:
df1 = df1.drop(['New_Price'], axis = 1)
df1.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74

In [22]:
mode_engine = df1['Engine'].mode()
mode_engine

0    1197 CC
dtype: object

In [23]:
df1['Engine']= df1['Engine'].fillna('1197 CC')

In [24]:
df1.isnull().sum()

Unnamed: 0            0
Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               2
Engine                0
Power                36
Seats                42
Price                 0
dtype: int64

# Outliers

In [25]:
def outlier(list):
    import pandas as pd
    df1=pd.Series(list)
    q1=df1.quantile(0.25)
    q3=df1.quantile(0.75)
    iqr=q3-q1
    left=q1-(1.5*iqr)
    right=q3+(1.5*iqr)
    ol=[]
    for i in list:
        if i<left or i>right:
            ol.append(i)
    print ('data range', left,'to', right)
    if len(ol)>0:
        print ('Outliers are ', ol)
    else:
        print ('There are no outliers in your data')
    return

In [26]:
import random
yob=list(range(1945, 2002))
random.shuffle(yob)
yob.append(1920)
yob.append(2030)
print (yob)

[1963, 1964, 1956, 1998, 1965, 1947, 1945, 1985, 1996, 1962, 1955, 1978, 1999, 1971, 1990, 1974, 1951, 1957, 1975, 1954, 1981, 1946, 1997, 1994, 1961, 1968, 1950, 1953, 1992, 1977, 1948, 1959, 1966, 1972, 1973, 1952, 1970, 1986, 1991, 1987, 2001, 1979, 1967, 1995, 1960, 1988, 1983, 1984, 1989, 1982, 1949, 1958, 1993, 1976, 1980, 2000, 1969, 1920, 2030]

In [28]:
variance_std(yob)

('Mean value is',
 1973.0677966101696,
 'variance value is:',
 370.4436002337815,
 'Standarad deviation is ',
 19.246911446613492)

In [29]:
outlier(yob)

data range 1915.0 to 2031.0
There are no outliers in your data